export const API_BASE = 'https://lysk-battle-record-426168069563.asia-southeast1.run.app/';
// export const API_BASE = 'http://localhost:8080/';

export const LEVEL_TYPES = [
    { type: "光", count: 180 },
    { type: "冰", count: 180 },
    { type: "火", count: 180 },
    { type: "能量", count: 150 },
    { type: "引力", count: 120 },
    { type: "开放", count: 240 },
];

export const DROPDOWN_VALUES = {
    搭档: ["沈星回", "黎深", "祁煜", "秦彻", "夏以昼"],
    搭档身份: [],
    日卡: [],
    阶数: ["I", "II", "III", "IV", "无套装"],
    武器: ["专武", "重剑", "单手剑", "法杖", "手枪"],
    对谱: ["顺谱", "对六", "对五", "对四", "对三", "对二", "对一", "对零", "不确定"],
    沈星回搭档: ["光猎", "逐光骑士", "遥远少年", "Evol特警", "深空猎人"],
    黎深搭档: ["九黎司命", "永恒先知", "极地军医", "黎明抹杀者", "临空医生"],
    祁煜搭档: ["潮汐之神", "深海潜行者", "画坛新锐", "海妖魅影", "艺术家"],
    秦彻搭档: ["深渊主宰", "无尽掠夺者", "异界来客"],
    夏以昼搭档: ["终极兵器X-02", "远空执舰官", "深空飞行员"],
    沈星回日卡: ["末夜", "逐光", "睱日", "弦光", "心情", "匿光", "无套装"],
    黎深日卡: ["拥雪", "永恒", "夜色", "静谧", "心情", "深林", "无套装"],
    祁煜日卡: ["神殿", "深海", "点染", "斑斓", "心情", "碧海", "无套装"],
    秦彻日卡: ["深渊", "掠心", "锋尖", "戮夜", "无套装"],
    夏以昼日卡: ["寂路", "远空", "长昼", "离途", "无套装"],
};

export const PANEL_KEYS = [
    "生命", "攻击", "防御", "暴击", "暴伤", "誓约增伤", "誓约回能", "加速回能", "虚弱增伤", "对谱", "搭档", "搭档身份", "日卡", "阶数", "武器"
];

export const DISPLAY_PANEL_KEYS = [
    "攻击", "防御", "生命", "对谱", "暴击", "暴伤", "誓约增伤", "誓约回能", "加速回能", "虚弱增伤", "搭档身份", "日卡", "阶数", "武器"
];

export const LATEST_DISPLAY_PANEL_KEYS = [
    "关卡", "关数", "攻击", "防御", "生命", "对谱", "暴击", "暴伤", "誓约增伤", "誓约回能", "加速回能", "虚弱增伤", "搭档身份", "日卡", "阶数", "武器"
];