export const LEVEL_TYPES = {
    "稳定": [
        { type: "光", count: 180 },
        { type: "冰", count: 180 },
        { type: "火", count: 210 },
        { type: "能量", count: 150 },
        { type: "引力", count: 120 },
        { type: "开放", count: 300 },
    ],
    "波动": [
        { type: "光", count: 0 },
        { type: "冰", count: 0 },
        { type: "火", count: 0 },
        { type: "能量", count: 0 },
        { type: "引力", count: 0 },
        { type: "开放", count: 60 },
    ]
};

export const DROPDOWN_VALUES = {
    搭档: ["沈星回", "黎深", "祁煜", "秦彻", "夏以昼"],
    搭档身份: [],
    日卡: [],
    阶数: ["I (零阶)", "II (一阶)", "III (二阶)", "IV (三阶)", "无套装"],
    武器: ["专武", "重剑", "单手剑", "法杖", "手枪"],
    对谱: ["顺", "逆", "不确定"],
    对谱加成: ["30", "25", "20", "15", "10", "5", "0", "不确定"],
    加成: ["40", "30", "20", "10", "0"],
    沈星回搭档: ["光猎", "逐光骑士", "遥远少年", "Evol特警", "深空猎人"],
    黎深搭档: ["九黎司命", "永恒先知", "极地军医", "黎明抹杀者", "临空医生"],
    祁煜搭档: ["利莫里亚海神", "潮汐之神", "深海潜行者", "画坛新锐", "海妖魅影", "艺术家"],
    秦彻搭档: ["深渊主宰", "无尽掠夺者", "异界来客"],
    夏以昼搭档: ["终极兵器X-02", "远空执舰官", "深空飞行员"],
    沈星回日卡: ["末夜", "逐光", "睱日", "弦光", "心晴", "匿光", "无套装"],
    黎深日卡: ["拥雪", "永恒", "夜色", "静谧", "心晴", "深林", "无套装"],
    祁煜日卡: ["雾海", "神殿", "深海", "坠浪", "点染", "斑斓", "心晴", "碧海", "无套装"],
    秦彻日卡: ["深渊", "掠心", "锋尖", "戮夜", "无套装"],
    夏以昼日卡: ["寂路", "远空", "长昼", "离途", "无套装"],
};